# RFM
- Recency
- Frequency
- Monetary

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
PATH = "/content/drive/My Drive/Road to DS DA/data/ecommerce_data.csv"
df = pd.read_csv(PATH)

In [ ]:
df[:3]

         date  product_id  city_id  orders
0  2019-12-16        1897       26       2
1  2019-12-16        4850       26       4
2  2019-12-16        2466       26       1

In [ ]:
df.shape

(523684, 4)

In [ ]:
price_ls = np.random.random_integers(100, 100000, 523684)
len(price_ls)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning: This function is deprecated. Please call randint(100, 100000 + 1) instead
  """Entry point for launching an IPython kernel.

523684

In [ ]:
df["price"] = price_ls

In [ ]:
df[:3]

         date  product_id  city_id  orders  price
0  2019-12-16        1897       26       2  23762
1  2019-12-16        4850       26       4  43345
2  2019-12-16        2466       26       1  97725

In [ ]:
len(df["city_id"].unique())

31

In [ ]:
df["user_id"] = range(1,523684+1, 1)

In [ ]:
df[:3]

         date  product_id  city_id  orders  price  user_id
0  2019-12-16        1897       26       2  23762        1
1  2019-12-16        4850       26       4  43345        2
2  2019-12-16        2466       26       1  97725        3

## Preprocessing
- date -> Recency
- order -> Frequency
- price -> Monetary

### Recency

In [ ]:
import datetime

In [ ]:
df['date_now'] = datetime.datetime.now()

In [ ]:
df['date'] = pd.to_datetime(df['date'])

In [ ]:
df[:3]

        date  product_id  city_id  ...  price  user_id                   date_now
0 2019-12-16        1897       26  ...  23762        1 2020-10-15 15:14:00.915631
1 2019-12-16        4850       26  ...  43345        2 2020-10-15 15:14:00.915631
2 2019-12-16        2466       26  ...  97725        3 2020-10-15 15:14:00.915631

[3 rows x 7 columns]

In [ ]:
df['Recency'] = df['date_now'] - df['date']

In [ ]:
df[:3]

        date  product_id  ...                   date_now                  Recency
0 2019-12-16        1897  ... 2020-10-15 15:14:00.915631 304 days 15:14:00.915631
1 2019-12-16        4850  ... 2020-10-15 15:14:00.915631 304 days 15:14:00.915631
2 2019-12-16        2466  ... 2020-10-15 15:14:00.915631 304 days 15:14:00.915631

[3 rows x 8 columns]

In [ ]:
df["Recency"] = df["Recency"].astype('timedelta64[h]')

In [ ]:
df[:3]

        date  product_id  city_id  ...  user_id                   date_now  Recency
0 2019-12-16        1897       26  ...        1 2020-10-15 15:14:00.915631   7311.0
1 2019-12-16        4850       26  ...        2 2020-10-15 15:14:00.915631   7311.0
2 2019-12-16        2466       26  ...        3 2020-10-15 15:14:00.915631   7311.0

[3 rows x 8 columns]

In [ ]:
from sklearn.preprocessing import MinMaxScaler

In [ ]:
norm = MinMaxScaler((1,5))

In [ ]:
df[["Frequency", "Monetary", "Recency"]] = norm.fit_transform(df[["orders", "price", "Recency"]])

In [ ]:
df[:3]

        date  product_id  city_id  ...  Recency  Frequency  Monetary
0 2019-12-16        1897       26  ...      1.0   1.000032  1.947427
1 2019-12-16        4850       26  ...      1.0   1.000095  2.731532
2 2019-12-16        2466       26  ...      1.0   1.000000  4.908909

[3 rows x 10 columns]

In [ ]:
df["Recency"] = 6 - df["Recency"]

In [ ]:
df[:3]

        date  product_id  city_id  ...  Recency  Frequency  Monetary
0 2019-12-16        1897       26  ...      5.0   1.000032  1.947427
1 2019-12-16        4850       26  ...      5.0   1.000095  2.731532
2 2019-12-16        2466       26  ...      5.0   1.000000  4.908909

[3 rows x 10 columns]

## ทำการรวม 3 Columns เพื่อหา Loyalty Customer

In [ ]:
df["loyalty_sc"] = df[["Frequency", "Monetary", "Recency"]].mean(axis=1)

In [ ]:
df[:3]

        date  product_id  city_id  ...  Frequency  Monetary  loyalty_sc
0 2019-12-16        1897       26  ...   1.000032  1.947427    2.649153
1 2019-12-16        4850       26  ...   1.000095  2.731532    2.910542
2 2019-12-16        2466       26  ...   1.000000  4.908909    3.636303

[3 rows x 11 columns]

In [ ]:
df = df.sort_values(by="loyalty_sc", ascending=False)
df[:10]

           date  product_id  city_id  ...  Frequency  Monetary  loyalty_sc
1123 2019-12-16        7541       18  ...   1.000126  4.998398    3.666175
685  2019-12-16        2941        0  ...   1.000063  4.997437    3.665833
580  2019-12-16        1622        9  ...   1.000536  4.992673    3.664403
3868 2019-12-15        7011        9  ...   1.001513  4.998759    3.664213
5867 2019-12-15        6300       22  ...   1.000126  4.999800    3.664097
2035 2019-12-15         202        2  ...   1.000000  4.999920    3.664095
4267 2019-12-15        2556        0  ...   1.000000  4.999640    3.664002
1296 2019-12-16        4889       17  ...   1.000063  4.991552    3.663872
6458 2019-12-15        6780       24  ...   1.000000  4.999039    3.663802
520  2019-12-16        3499       14  ...   1.000000  4.990390    3.663463

[10 rows x 11 columns]